<template>
  <div class="wrapper_modal" @click.stop="hideModal">
    <div class="modal" @click.stop>
      <img
        class="close-btn"
        src="@/assets/icons/buttons/x-circle.svg"
        @click="hideModal"
      />
      <h2 class="header global_text">Политика конфиденциальности</h2>
      <div class="content">
        <ol>
          <li>
            <span class="uppercase">Общие положения</span>
            <p>
              Настоящая Политика конфиденциальности (далее — "Политика")
              регулирует порядок обработки и защиты персональных данных
              Пользователей приложения "Twelve" (далее — "Приложение"),
              принадлежащего TEAM "12 PEOPLE" (далее — "Компания").
            </p>
            <p>
              Используя Приложение, Пользователь дает свое согласие на обработку
              его персональных данных в соответствии с условиями настоящей
              Политики.
            </p>
          </li>

          <li>
            <span class="uppercase">Какие данные мы собираем</span>
            <p><strong>2.1. Данные, предоставляемые Пользователем:</strong></p>
            <ol>
              <li>Адрес электронной почты (при регистрации);</li>
              <li>Данные аккаунта Google (при регистрации через Google);</li>
              <li>Имя пользователя (никнейм);</li>
              <li>Аватар (по желанию Пользователя).</li>
            </ol>
            <p><strong>2.2. Данные, собираемые автоматически:</strong></p>
            <ol>
              <li>Тип устройства, модель, версия ОС;</li>
              <li>Уникальный идентификатор устройства (IDFA/GAID);</li>
              <li>IP-адрес;</li>
              <li>Данные об игровом прогрессе (уровни, достижения);</li>
              <li>Логи работы Приложения (для исправления ошибок);</li>
              <li>Язык устройства и регион.</li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Цели обработки персональных данных</span>
            <p>
              Компания обрабатывает персональные данные Пользователя в следующих
              целях:
            </p>
            <ol>
              <li>
                Предоставление доступа к Услугам и функционалу Приложения;
              </li>
              <li>Сохранение игрового прогресса и достижений Пользователя;</li>
              <li>Техническая поддержка и улучшение работы Приложения;</li>
              <li>
                Анализ использования Приложения для улучшения пользовательского
                опыта;
              </li>
              <li>
                Предотвращение мошенничества и нарушений условий Соглашения;
              </li>
              <li>
                Отправка уведомлений о Обновлениях и изменениях (с согласия
                Пользователя).
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Правовые основания обработки</span>
            <p>
              Обработка персональных данных осуществляется на следующих
              основаниях:
            </p>
            <ol>
              <li>
                Согласие Пользователя, выраженное путем проставления галочки при
                первом запуске Приложения;
              </li>
              <li>
                Исполнение договора (Пользовательского соглашения), стороной
                которого является Пользователь;
              </li>
              <li>
                Соблюдение требований действующего законодательства Российской
                Федерации.
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Передача данных третьим лицам</span>
            <p>
              <strong
                >5.1. Компания может передавать персональные данные третьим
                лицам в следующих случаях:</strong
              >
            </p>
            <ol>
              <li>
                Когда это необходимо для функционирования Приложения (хостинг,
                аналитика, push-уведомления);
              </li>
              <li>
                Когда этого требует действующее законодательство или
                компетентный государственный орган;
              </li>
              <li>Для защиты прав и законных интересов Компании.</li>
            </ol>
            <p>
              <strong>5.2. Третьи лица, с которыми мы взаимодействуем:</strong>
            </p>
            <ol>
              <li>Google Play — платформа распространения Приложения;</li>
              <li>Google Firebase — аналитика и исправление ошибок;</li>
              <li>
                Хостинг-провайдеры для хранения данных (при наличии серверной
                части).
              </li>
            </ol>
            <p>
              Все третьи лица обязаны обеспечивать конфиденциальность
              персональных данных и обрабатывать их исключительно в соответствии
              с инструкциями Компании.
            </p>
          </li>

          <li>
            <span class="uppercase">Хранение и защита данных</span>
            <ol>
              <li>
                Хранение персональных данных осуществляется на территории
                Российской Федерации или иных стран, обеспечивающих адекватный
                уровень защиты прав субъектов персональных данных.
              </li>
              <li>
                Компания принимает необходимые организационные и технические
                меры для защиты персональных данных от неправомерного доступа,
                уничтожения, изменения или распространения.
              </li>
              <li>
                Персональные данные Пользователей хранятся в течение срока
                использования Приложения Пользователем. После удаления
                Приложения или аккаунта данные могут храниться до 30 (тридцати)
                календарных дней, если иное не требуется законодательством.
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Права Пользователя</span>
            <p>Пользователь имеет право:</p>
            <ol>
              <li>
                Получить информацию о том, какие персональные данные
                обрабатываются;
              </li>
              <li>
                Требовать уточнения, блокирования или уничтожения своих
                персональных данных;
              </li>
              <li>Отозвать согласие на обработку персональных данных;</li>
              <li>
                Требовать удаления своего аккаунта и связанных с ним данных;
              </li>
              <li>
                Обратиться в компетентные государственные органы для защиты
                своих прав.
              </li>
            </ol>
            <p>
              Для реализации своих прав Пользователь может направить запрос по
              адресу:
              <em>twelvepeoplegame@gmail.com</em>
            </p>
          </li>

          <li>
            <span class="uppercase">Сбор данных несовершеннолетних</span>
            <ol>
              <li>
                Приложение не предназначено для лиц младше 14 лет. Компания не
                осуществляет целенаправленный сбор персональных данных лиц
                младше 14 лет.
              </li>
              <li>
                Если Компании станет известно, что персональные данные лица
                младше 14 лет были предоставлены без согласия родителей или
                законных представителей, такие данные будут незамедлительно
                удалены.
              </li>
              <li>
                Законные представители несовершеннолетних Пользователей в
                возрасте от 14 до 18 лет несут ответственность за ознакомление
                несовершеннолетних с условиями настоящей Политики.
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase"
              >Использование файлов cookie и аналитики</span
            >
            <ol>
              <li>
                В мобильном приложении могут использоваться аналоги cookie
                (например, идентификаторы устройств) для анализа поведения
                Пользователей.
              </li>
              <li>
                Пользователь может ограничить сбор аналитических данных через
                настройки своего устройства (ограничение отслеживания рекламы).
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Изменение Политики конфиденциальности</span>
            <ol>
              <li>
                Компания оставляет за собой право вносить изменения в настоящую
                Политику. Изменения вступают в силу с момента их публикации в
                Приложении.
              </li>
              <li>
                Компания обязуется уведомлять Пользователей о существенных
                изменениях за 7 (семь) календарных дней до их вступления в силу
                посредством публикации уведомления в Приложении.
              </li>
              <li>
                Продолжение использования Приложения после внесения изменений
                означает согласие Пользователя с обновленной Политикой.
              </li>
            </ol>
          </li>

          <li>
            <span class="uppercase">Контактная информация</span>
            <ol>
              <li>
                По всем вопросам, связанным с обработкой персональных данных,
                Пользователь может обратиться в Компанию следующим способом:<br />
                <i>Отправить письмо по адресу:</i><br />
                <em>twelvepeoplegame@gmail.com</em>
              </li>
              <li>
                Компания обязуется рассмотреть обращение и дать ответ в течение
                30 (тридцати) календарных дней с момента получения запроса.
              </li>
            </ol>
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"
export default defineComponent({
  name: "PolicyModal",
  props: {
    text: {
      type: String,
      required: false,
      default: "",
    },
  },
  emits: ["close-modal"],
  methods: {
    hideModal(): void {
      this.$emit("close-modal")
    },
  },
})
</script>

<style scoped>
.wrapper_modal {
  position: absolute;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  z-index: 999;
  background: hsla(216, 23%, 9%, 0.9);
  display: flex;
  align-items: center;
  justify-content: center;
}

.close-btn {
  width: 20px;
  height: 20px;
  position: absolute;
  top: 16px;
  right: 16px;
}

.header {
  margin-bottom: 3rem;
  background: var(--six-gold-gradient);
  -webkit-background-clip: text;
  -webkit-text-fill-color: transparent;
  background-clip: text;
}

.content {
  overflow-y: scroll;
  font-family: "Inter", serif;
  font-style: normal;
  font-weight: 400;
  font-size: 16px;
  line-height: 22px;
  letter-spacing: -0.02em;
  font-feature-settings: "calt" off;
  color: #fceabc;
}

.modal {
  position: relative;
  height: 80%;
  max-width: 335px;
  width: 100%;
  background: var(--third-dark-gradient);
  border-radius: 18px;
  padding: 45px 22px;
  display: flex;
  flex-direction: column;
}

p,
ol li {
  margin-top: 0.5em;
  margin-bottom: 1em;
}

.uppercase {
  text-transform: uppercase;
}

ol {
  list-style: none;
  counter-reset: li;
}

li:before {
  counter-increment: li;
  content: counters(li, ".") ". ";
}

*::-webkit-scrollbar {
  width: 4px;
}

*::-webkit-scrollbar-track {
  background: #272f41;
  border-radius: 5px;
}

*::-webkit-scrollbar-thumb {
  background: #fceabc;
  border-radius: 5px;
}
</style>
