<template>
  <div class="basics-general">
    <ul class="list">
      <li class="list__item">
        <span class="list__term">Жизни</span> — жизни карты
      </li>
      <li class="list__item">
        <span class="list__term">Урон</span> — справа в ромбе - сколько урона
        может нанести карта врага игроку
      </li>
      <li class="list__item">
        <span class="list__term">Тип хода</span> — слева наверху - куда карта
        врага может ходить. Варианты - вниз, направо (направо и вниз), случайный
        прыжок, стоять на месте (точка)
      </li>
      <li class="list__item">
        <span class="list__term">Пассивная способость</span> — отображается
        значком часов (или часов с числом внутри).
      </li>
      <li class="list__item">
        <span class="list__term">Способность завещания</span> — значок листа
        бумаги - способность карты врага, которая срабатывает как только врага
        убивают.
      </li>
      <li class="list__item">
        <span class="list__term">Статус врага</span> — нижний правый край. Может
        быть - красный значок (враг не попадает в кладбище врагов после
        убийства), синий значок (покров - врага нельзя заблокировать или
        изменить ему статус), зеленый (яд - как только враг получит 2й раз такой
        статус - он умрет).
      </li>
      <li class="list__item">
        <span class="list__term">Щит врага</span> — значок щита по центру врага.
        Чтобы нанести такому врагу урон, вначале надо сбить ему щит.
      </li>
    </ul>
    <p class="text">
      Чтобы войти в режим просмотра описания карты врага - нужно на карте зажать
      и подержать пальцем/мышкой (или правая клавиша мыши на компе) - откроется
      карта на весь экран со всеми описаниями. В них можно переключать между
      основной спобностью, пассивной способностью и завещанием.
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "CardsEnemyCards",
})
</script>

<style scoped>
@import "./rules-shared.css";
</style>
