<template>
  <div class="basics-general">
    <p class="section-title">
      Некоторые карты могут переигрывать другие карты:
    </p>
    <ul class="list">
      <li class="list__item">
        <span class="list__term">Значок</span> - как правило, такие карты имеют
        синий значок с изображением карт
      </li>
      <li class="list__item">
        <span class="list__term">Из разных мест</span> - переигрывать можно
        карты из сброса, из колоды, даже из сброса врагов! Читайте описания
        карт, чтобы понять, что они делают!
      </li>
    </ul>
    <p class="section-title">Переигрывание карт:</p>
    <p class="text">
      При игре в какую-то дополнительную карту, открывается окно с выбором
      карты, которую можно сыграть. Или выбором допустимых карт, с которыми
      можно взаимодействовать. Двойной клик по карте - приведет в действие
      способность. Исходная способность, как правило, написана в открывшемся
      окне.
    </p>
    <p class="text">
      Если переигрывается какая-то дополнительная карта - то она появляется на
      месте кнопки ХОД, закрывая ее! В таком случае - нужно тянуть за эту карту
      и целиться во врагов, как обычно, ход будет этой картой!
    </p>
    <p class="text">
      Такие цепочки можно продлять: например одна карта играет другую из сброса,
      та играет какую-то из колоды, та увеличивает какой-то карте в руке урон
      итп итп
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "GameAdditionalCards",
})
</script>

<style scoped></style>
