<template>
  <div class="basics-general">
    <p class="text">
      Чтобы походить - тащим за карту в руке - за ней рисуется стрелка. Если
      наводим на какого-то врага - враг начинает мигать. Отпускаем палец/мышку
      на нем - происходит ход.
    </p>
    <p class="text">
      В результате хода врагу будет нанасен урон, равный урону той карты,
      которой вы ходили.
    </p>
    <p class="text">
      То есть, у него убавятся жизни на значение урона вашей карты. Например, у
      него было 10 жизней, а у вашей карты 8 урона. У врага после вашего хода
      останется 2 жизни.
    </p>
    <p class="text">
      Если после хода у врага стало жизней 0 (или меньше), враг исчезнет с поля
      (умрет) и попадет в кладбище врагов.
    </p>
    <p class="text">
      Если у врага есть способность завещания, она сработает в этот момент!
    </p>
    <p class="text">
      При этом у вашей карты в руке количество зарядов уменьшиться на 1.
    </p>
    <p class="text">
      Если после хода количество зарядов стало 0, ваша карта сбросится из руки в
      ваш сброс (кладбище)
    </p>

    <div class="highlight-block">
      <span class="highlight-block__label">ВНИМАНИЕ!</span>
      <p class="highlight-block__text">
        За 1 ход можно походить только одной вашей карты из руки! Лидером можно
        ходить в любой момент, пока у него есть заряды. Или не ходить. Решать
        вам.
      </p>
    </div>

    <p class="text">
      Лидером - то же самое - целитесь, ходите, уменьшается его заряд на 1.
    </p>

    <div class="highlight-block">
      <span class="highlight-block__label">Добор карт</span>
      <p class="highlight-block__text">
        Если вы не ходили на этом ходу картой из руки, и у вас не полна рука (а
        максильманый размер руки определяется через прокачку этого параметра),
        вам доступна кнопка взять карты (выше кнопки ХОД)
      </p>
    </div>

    <p class="text">
      По кнопке взять карты - вы возьмете до 2х случайных карт из вашей колоды
      (так, чтобы рука при этом не стала полна). Откроется окно как в начале
      игры, в котором вы можете заменить 1 карту из вашей руки на случайную
      карту из вашей колоды
    </p>

    <div class="highlight-block">
      <span class="highlight-block__label">Окончание хода</span>
      <p class="highlight-block__text">
        После хода картой из руки или добора карт - ходить на этом ходу картой
        из руки уже нельзя
      </p>
    </div>

    <p class="text">
      Для перехода хода компьютеру - нажмите два раза кнопку ХОД
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "GameMove",
})
</script>

<style scoped>
@import "./rules-shared.css";
</style>
