<template>
  <div class="basics-general">
    <p class="section-title">Пассивные способности карт врага:</p>
    <ul class="list">
      <li class="list__item">
        <span class="list__term">На поле</span> - автоматически будут
        срабатывать после окончания хода врага, находясь на поле. В описании
        таких карт так и сказано - срабатывают когда карта врага находится на
        поле!
      </li>
      <li class="list__item">
        <span class="list__term">В колоде врага</span> - автоматически будут
        срабатывать после окончания хода врага, находясь в колоде. В описании
        таких карт так и сказано - срабатывают когда карта врага находится в
        колоде!
      </li>
      <li class="list__item">
        <span class="list__term">В сбросе врага</span> - автоматически будут
        срабатывать после окончания хода врага, находясь в сбросе. В описании
        таких карт так и сказано - срабатывают когда карта врага находится в
        сбросе!
      </li>
      <li class="list__item">
        <span class="list__term">Пассивка лидера врагов</span> - автоматически
        срабатывать после окончания всех ходов врагов, срабатывает для лидера
        врагов.
      </li>
    </ul>
    <p class="section-title">Таймеры пассивных способностей:</p>
    <ul class="list">
      <li class="list__item">
        <span class="list__term">Часы без числа</span> - пассивная способность
        срабатывает КАЖДЫЙ ХОД
      </li>
      <li class="list__item">
        <span class="list__term">Часы с числом</span> - в описании сказано когда
        она срабатывает - или КАЖДЫЙ ход, пока таймер не равен нулю, или ТОЛЬКО
        тогда когда таймер равен 0.
      </li>
    </ul>
    <p class="section-title">Сброс таймера:</p>
    <ul class="list">
      <li class="list__item">
        <span class="list__term">Сбрасывается</span> - если пассивная
        способность с числом и не срабатывает каждый ход, то она срабатывает
        только когда таймер равен 0. В описании может быть сказано, что таймер
        восстанавливается, и это значит, что пассивная спобоность сработает
        потом снова через значение таймера ходов.
      </li>
      <li class="list__item">
        <span class="list__term">Не сбрасывается</span> - таймер сработал один
        раз и всё, пассивная способность дальше не работает. Тогда в описании не
        будет записи о том, что таймер восстанавливается.
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "GamePassivesEnemy",
})
</script>

<style scoped>
@import "./rules-shared.css";
</style>
