<template>
  <div class="basics-general">
    <p class="text">
      Почти все ресурсы можно купить за игровые деньги, продать за игровые
      деньги, создать из других ресурсов, уничтожить/перемолоть, получив за это
      ресурсы
    </p>
    <p class="text">
      Осуществляется это на странице бонусов (клик по ресурсам, клик по большому
      меню ресурсов
    </p>
    <p class="text">
      На странице бонусов 3 вкладки - награды, для карт, для уровней
    </p>
    <p class="text">
      Награды - тут можно открыть бочки, коробки и ключи. Бочка - 3 карты из
      которых выбрать одну. Яркая бочка - 5 карт, из которых выбрать одну.
      Коробка - 3 карты, все 3 из которых достаются игроку. Ключ - 3 награды, из
      которых можно выбрать одну.
    </p>
    <p class="text">
      Покупка/продажа - всегда меняет деньги на ресурс. Крафт - всегда требует
      других ресурсов и денег. Уничтожение - всегда требует немного денег, а
      получает другие ресурсы
    </p>
    <p class="text">
      В случае крафта почти всегда можно выбрать схему, из чего крафтить.
    </p>
    <p class="text">
      Поскольку на все ресурсы есть лимит (через прокачку) - больше чем этот
      лимит иметь ресурсов нельзя. Прокачивайте эти лимиты и увеличивайте их.
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "ResBonuses",
})
</script>

<style scoped>
@import "./rules-shared.css";
</style>
