<template>
  <div class="basics-general">
    <ul class="list">
      <li class="list__item">
        <span
          >Сбор колоды начинается с выбора фракции. Из нейтральных карт нельзя
          собирать колоду.</span
        >
      </li>
      <li class="list__item">
        <span>Лидер обязательно должен быть из выбранной фракции.</span>
      </li>
      <li class="list__item">
        <span
          >Карты обязательно должны быть из выбранной фракции + из нейтральных
          карт. То есть, нейтральные карты можно брать в любую колоду.</span
        >
      </li>
      <li class="list__item">
        <span
          >Добавлять в колоду можно только открытые карты - те, которые есть в
          коллекции игрока. Такие карты помечаются цифрой 1 (или больше) - внизу
          в треугольнике у карты. Так же у открытых карт видны картинки, а у
          закрытых нет</span
        >
      </li>
      <li class="list__item">
        <span>
          При сборе колоды удобно в фильтре выбрать "наличие", поставив там 1.
        </span>
      </li>
      <li class="list__item">
        <span
          >Количество карт в колоде определяется из прокачки игрока
          соответствующего параметра. По умолчанию - 10 карт в колоде. Карт
          должно быть строго от 10 и до значения из раздела прокачки. Например
          для значения 15 в колоду можно положить от 10 до 15 карт. При сборе
          колоды это значение указывается в графе размер.</span
        >
      </li>
      <li class="list__item">
        <span
          >Добавление карты или лидера осуществляется двойным кликом на
          карту/лидера. В колоду можно положить только одну копию каждой карты.
          При добавлении карты в колоду она исчезает из зоны карт и добавляется
          в зону сбора колоды. Убрать ее из колоды - двойной клик, при этом
          карта вернется в зону карт.</span
        >
      </li>
      <li class="list__item">
        <span
          >Для удобства отображение в зоне колоды видна только крайняя
          добавленная карта, но клик на любую другую карту - перемещает ее в
          фокус. Попробуйте!</span
        >
      </li>
      <li class="list__item">
        <span
          >У каждой карты и лидера есть жизни! Итоговые жизни всей колоды - это
          сумма жизней всех добавленных в колоду карт! Это значение показывается
          в зоне сборе колоды</span
        >
      </li>
      <li class="list__item">
        <span
          >Максимальный запас жизней колоды ограничен значением из прокачки - по
          умолчанию 100. Прокачайте это значение, и колоды будут более
          мощными.</span
        >
      </li>
      <li class="list__item">
        <span
          >После выбора лидера и добавления необходимого количества карт, нужно
          ввести имя колоды и нажать создать. Колода добавится к вам в
          коллекцию.</span
        >
      </li>
      <li class="list__item">
        <span
          >Не волнуйтесь - создание колоды можно отменить кнопкой крестик
          слева.</span
        >
      </li>
      <li class="list__item">
        <span
          >Не волнуйтесь - колоду можно будет изменить или удалить потом в любой
          момент!</span
        >
      </li>
      <li class="list__item">
        <span>
          При сборе колоды можно пользоваться фильтрами (кнопка справа)
        </span>
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue"

export default defineComponent({
  name: "CardsDeck",
})
</script>

<style scoped>
@import "./rules-shared.css";
</style>
